#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CineGooseberry_01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CineCharacterBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CineGooseberry-01_BP.CineGooseberry-01_BP_C
// 0x0040 (0x02B8 - 0x0278)
class ACineGooseberry_01_BP_C final : public ACineCharacterBase_BP_C
{
public:
	class USkeletalMeshComponent*                 Futterman;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Gooseberry_Skirt;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body;                                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          FuttermanAnimation;                                // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FuttermanPosition;                                 // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideHeadRotation;                              // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               HeadRotation;                                      // 0x02A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void GetFuttermanAnimation(class USkeletalMeshComponent* NewParam, class UAnimSequence** Animation);
	void SetDrillOn(bool drillOn, float DrillRate);
	void UserConstructionScript();
	void GetCineFaceAnimBP(class UCineFace_AnimBP_C** CineFaceAnimBP);
	void GetPoseAsset(class UPoseAsset** PoseAsset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CineGooseberry-01_BP_C">();
	}
	static class ACineGooseberry_01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACineGooseberry_01_BP_C>();
	}
};
static_assert(alignof(ACineGooseberry_01_BP_C) == 0x000008, "Wrong alignment on ACineGooseberry_01_BP_C");
static_assert(sizeof(ACineGooseberry_01_BP_C) == 0x0002B8, "Wrong size on ACineGooseberry_01_BP_C");
static_assert(offsetof(ACineGooseberry_01_BP_C, Futterman) == 0x000278, "Member 'ACineGooseberry_01_BP_C::Futterman' has a wrong offset!");
static_assert(offsetof(ACineGooseberry_01_BP_C, Gooseberry_Skirt) == 0x000280, "Member 'ACineGooseberry_01_BP_C::Gooseberry_Skirt' has a wrong offset!");
static_assert(offsetof(ACineGooseberry_01_BP_C, Head) == 0x000288, "Member 'ACineGooseberry_01_BP_C::Head' has a wrong offset!");
static_assert(offsetof(ACineGooseberry_01_BP_C, Body) == 0x000290, "Member 'ACineGooseberry_01_BP_C::Body' has a wrong offset!");
static_assert(offsetof(ACineGooseberry_01_BP_C, FuttermanAnimation) == 0x000298, "Member 'ACineGooseberry_01_BP_C::FuttermanAnimation' has a wrong offset!");
static_assert(offsetof(ACineGooseberry_01_BP_C, FuttermanPosition) == 0x0002A0, "Member 'ACineGooseberry_01_BP_C::FuttermanPosition' has a wrong offset!");
static_assert(offsetof(ACineGooseberry_01_BP_C, OverrideHeadRotation) == 0x0002A4, "Member 'ACineGooseberry_01_BP_C::OverrideHeadRotation' has a wrong offset!");
static_assert(offsetof(ACineGooseberry_01_BP_C, HeadRotation) == 0x0002A8, "Member 'ACineGooseberry_01_BP_C::HeadRotation' has a wrong offset!");

}

