#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: enemyFace_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function enemyFace_AnimBlueprint.enemyFace_AnimBlueprint_C.ExecuteUbergraph_enemyFace_AnimBlueprint
// 0x0188 (0x0188 - 0x0000)
struct enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_DynamicCast_AsRB_Pawn;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             CallFunc_GetFacePoseAsset_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_Map_Find_Value;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_1;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_2;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_3;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_4;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNPC*                                 K2Node_DynamicCast_AsRB_NPC;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_2; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_Map_Find_Value_5;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNPC_BP_C*                            K2Node_DynamicCast_AsRB_NPC_BP;                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_6;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_6;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_7;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_7;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_8;                         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_8;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_9;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_9;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_10;                        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_10;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_11;                        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_11;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_12;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_12;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_13;                        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_13;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_14;                        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_14;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_15;                        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_15;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_16;                        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_16;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint) == 0x000008, "Wrong alignment on enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint");
static_assert(sizeof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint) == 0x000188, "Wrong size on enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, EntryPoint) == 0x000000, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_AsRB_Pawn) == 0x000010, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_AsRB_Pawn' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_GetFacePoseAsset_ReturnValue) == 0x000020, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_GetFacePoseAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue) == 0x000028, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value) == 0x000030, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_1) == 0x000040, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_1) == 0x000048, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_2) == 0x000050, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_2) == 0x000058, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_3) == 0x000060, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_3) == 0x000068, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_4) == 0x000070, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_4) == 0x000078, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, Temp_bool_IsClosed_Variable) == 0x000079, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1) == 0x000080, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_GetOwningActor_ReturnValue) == 0x000088, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, Temp_bool_Has_Been_Initd_Variable) == 0x000090, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_AsRB_NPC) == 0x000098, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_AsRB_NPC' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A1, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_2) == 0x0000A8, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_GetOwningActor_ReturnValue_1) == 0x0000B0, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_5) == 0x0000B8, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_5' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_5) == 0x0000C0, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_AsRB_NPC_BP) == 0x0000C8, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_AsRB_NPC_BP' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_6) == 0x0000D8, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_6' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_6) == 0x0000E0, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_7) == 0x0000E8, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_7' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_7) == 0x0000F0, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_8) == 0x0000F8, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_8' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_8) == 0x000100, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_9) == 0x000108, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_9' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_9) == 0x000110, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_10) == 0x000118, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_10' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_10) == 0x000120, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_11) == 0x000128, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_11' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_11) == 0x000130, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_12) == 0x000138, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_12' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_12) == 0x000140, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_13) == 0x000148, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_13' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_13) == 0x000150, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_14) == 0x000158, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_14' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_14) == 0x000160, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_15) == 0x000168, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_15' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_15) == 0x000170, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_16) == 0x000178, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_16' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_16) == 0x000180, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000184, "Member 'enemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function enemyFace_AnimBlueprint.enemyFace_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct enemyFace_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(enemyFace_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on enemyFace_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(enemyFace_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on enemyFace_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(enemyFace_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'enemyFace_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function enemyFace_AnimBlueprint.enemyFace_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct enemyFace_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(enemyFace_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on enemyFace_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(enemyFace_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on enemyFace_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(enemyFace_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'enemyFace_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

